app/views/carts/index.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]
---
      <% end %>
      <p class="cart-top title"><i class="fa fa-shopping-cart fa_icon"></i><%= "#{current_user.lastname} #{current_user.firstname}" %>

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <!-- １商品の合計金額 -->
                    小計: <%= number_to_currency(cart.item.price*cart.count, unit: "¥", precision:0) %><br>