app/views/items/_form.html.erb

SELECT "brands".* FROM "brands"
---

      ブランド　　　　<%= f.collection_select :brand_id, Brand.all, :id, :brand_name %><%=link_to("ブランド名編集",brands_path)%><br>

SELECT "categories".* FROM "categories"
---
  <!--カテゴリー登録-->
      カテゴリー　　　<%= f.collection_select :category_id, Category.all, :id, :name %><%=link_to("カテゴリー編集",categories_path)%>

SELECT "sizes".* FROM "sizes"
---

      サイズ　　　　　<%= f.collection_select :size_id, Size.all, :id, :size_name %><%=link_to("サイズ編集",sizes_path)%><br>