app/controllers/items_controller.rb

  def index
    @item = Item.where(active: 0)
    @q = @item.search(params[:q])
---
SELECT "items".* FROM "items"

  def create
  	@item = Item.new(item_params)
    #Rails.logger.info(@item)
    @item.save
---
INSERT INTO "items" ("item_name", "image_id", "category_id", "size_id", "brand_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_name", ""], ["image_id", nil], ["category_id", 1], ["size_id", 1], ["brand_id", 1], ["created_at", "2018-02-15 10:44:45.611354"], ["updated_at", "2018-02-15 10:44:45.611354"]]

  def update
    item = Item.find(params[:id])
    if item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "release_date" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", nil], ["release_date", "2018-01-21"], ["updated_at", "2018-01-21 05:29:09.054387"], ["id", 6]]

  def destroy
    @item = Item.find(params[:id])
    @item.delete
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]