app/controllers/sizes_controller.rb

  def index
  	@size = Size.new
  	@sizes = Size.all
---
SELECT "sizes".* FROM "sizes"

  def create
  	@size = Size.new(size_params)
    @size.save
---
INSERT INTO "sizes" ("size_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["size_name", "S"], ["created_at", "2018-02-15 08:48:37.971853"], ["updated_at", "2018-02-15 08:48:37.971853"]]