app/controllers/users_controller.rb

  def show
    @user = current_user

    # 履歴表示
    @histories_for_user = History.where(user_id:@user.id)
    @histories = History.where(user_id: @user.id).order("id desc") #ログインユーザーの履歴を一覧化
    @history_ids = @histories.pluck(:history_address_id).uniq #@historiesからhistory_address_idの一覧を取得して配列にする
---
SELECT "histories"."history_address_id" FROM "histories" WHERE "histories"."user_id" = ? ORDER BY id desc  [["user_id", 1]]